emmaanuel/EcoPlug/arduino-IDE/hardware/ecoplug/avr/boards.txt
ecoplug.name=ECOPlug

ecoplug.upload.tool=arduino:avrdude
ecoplug.upload.protocol=arduino
ecoplug.upload.maximum_size=30720
ecoplug.upload.maximum_data_size=2048
ecoplug.upload.speed=57600

ecoplug.bootloader.tool=arduino:avrdude
ecoplug.bootloader.unlock_bits=0x3F
ecoplug.bootloader.lock_bits=0x0F
ecoplug.bootloader.low_fuses=0xe2
ecoplug.bootloader.high_fuses=0xDa
ecoplug.bootloader.extended_fuses=0x07
ecoplug.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex

ecoplug.build.f_cpu=8000000L
ecoplug.build.mcu=atmega328p
ecoplug.build.board=AVR_ECOPLUG
ecoplug.build.core=arduino:arduino
ecoplug.build.variant=arduino:standard

